week_6/w6d4/first_routes/app/controllers/artwork_shares_controller.rb

    def create
        artwork_shares = ArtworkShare.new(artwork_shares_params)
        if artwork_shares.save
---
INSERT INTO "artwork_shares" ("viewer_id", "artwork_id") VALUES ($1, $2) RETURNING "id"  [["viewer_id", 18], ["artwork_id", 11]]