week_6/w6d4/first_routes/app/controllers/users_controller.rb

INSERT INTO "users" ("username") VALUES ($1) RETURNING "id"  [["username", "Geodude"]]
---
    def create
        user = User.new(user_params)
        if user.save